{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 5,
      "content": "[SPACE]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 6,
      "content": "[NEWLINE]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "vocab": {
      "[UNK]": 0,
      "[CLS]": 1,
      "[SEP]": 2,
      "[PAD]": 3,
      "[MASK]": 4,
      "[SPACE]": 5,
      "[NEWLINE]": 6,
      "!": 7,
      "%": 8,
      "'": 9,
      ",": 10,
      "-": 11,
      ".": 12,
      "0": 13,
      "1": 14,
      "2": 15,
      "3": 16,
      "4": 17,
      "5": 18,
      "6": 19,
      "7": 20,
      "8": 21,
      "9": 22,
      ":": 23,
      ";": 24,
      ">": 25,
      "?": 26,
      "@": 27,
      "A": 28,
      "B": 29,
      "C": 30,
      "D": 31,
      "E": 32,
      "F": 33,
      "G": 34,
      "H": 35,
      "I": 36,
      "J": 37,
      "K": 38,
      "L": 39,
      "M": 40,
      "N": 41,
      "O": 42,
      "P": 43,
      "Q": 44,
      "R": 45,
      "S": 46,
      "T": 47,
      "U": 48,
      "V": 49,
      "W": 50,
      "X": 51,
      "Y": 52,
      "Z": 53,
      "a": 54,
      "b": 55,
      "c": 56,
      "d": 57,
      "e": 58,
      "f": 59,
      "g": 60,
      "h": 61,
      "i": 62,
      "j": 63,
      "k": 64,
      "l": 65,
      "m": 66,
      "n": 67,
      "o": 68,
      "p": 69,
      "q": 70,
      "r": 71,
      "s": 72,
      "t": 73,
      "u": 74,
      "v": 75,
      "w": 76,
      "x": 77,
      "y": 78,
      "z": 79,
      "00": 80,
      "th": 81,
      "er": 82,
      "on": 83,
      "nd": 84,
      "ll": 85,
      "it": 86,
      "--": 87,
      "-->": 88,
      "hi": 89,
      "nder": 90,
      "Dhi": 91,
      "Inder": 92,
      "jit": 93,
      "llon": 94,
      "Dhillon": 95,
      "Inderjit": 96,
      "in": 97,
      "the": 98,
      "at": 99,
      "is": 100,
      "01": 101,
      "ou": 102,
      "es": 103,
      "an": 104,
      "ar": 105,
      "or": 106,
      "en": 107,
      "to": 108,
      "you": 109,
      "ing": 110,
      "10": 111,
      "ta": 112,
      "20": 113,
      "of": 114,
      "se": 115,
      "40": 116,
      "50": 117,
      "al": 118,
      "30": 119,
      "and": 120,
      "up": 121,
      "that": 122,
      "il": 123,
      "st": 124,
      "ion": 125,
      "this": 126,
      "me": 127,
      "60": 128,
      "ay": 129,
      "So": 130,
      "le": 131,
      "Gup": 132,
      "Gupta": 133,
      "re": 134,
      "ct": 135,
      "80": 136,
      "esh": 137,
      "Nil": 138,
      "Nilesh": 139,
      "ve": 140,
      "70": 141,
      "ke": 142,
      "90": 143,
      "as": 144,
      "so": 145,
      "all": 146,
      "li": 147,
      "be": 148,
      "no": 149,
      "ch": 150,
      "we": 151,
      "like": 152,
      "ut": 153,
      "ent": 154,
      "wh": 155,
      "ere": 156,
      "qu": 157,
      "ha": 158,
      "ed": 159,
      "gh": 160,
      "im": 161,
      "ro": 162,
      "are": 163,
      "kay": 164,
      "one": 165,
      "ne": 166,
      "for": 167,
      "ri": 168,
      "can": 169,
      "12": 170,
      "15": 171,
      "now": 172,
      "ally": 173,
      "Okay": 174,
      "wi": 175,
      "14": 176,
      "ght": 177,
      "ver": 178,
      "11": 179,
      "ust": 180,
      "po": 181,
      "19": 182,
      "if": 183,
      "17": 184,
      "us": 185,
      "13": 186,
      "18": 187,
      "ic": 188,
      "have": 189,
      "de": 190,
      "16": 191,
      "39": 192,
      "ra": 193,
      "lo": 194,
      "29": 195,
      "ation": 196,
      "And": 197,
      "do": 198,
      "ge": 199,
      "49": 200,
      "46": 201,
      "59": 202,
      "37": 203,
      "38": 204,
      "28": 205,
      "06": 206,
      "48": 207,
      "26": 208,
      "27": 209,
      "58": 210,
      "47": 211,
      "23": 212,
      "co": 213,
      "56": 214,
      "09": 215,
      "05": 216,
      "36": 217,
      "22": 218,
      "54": 219,
      "what": 220,
      "know": 221,
      "07": 222,
      "pro": 223,
      "02": 224,
      "24": 225,
      "57": 226,
      "ran": 227,
      "out": 228,
      "04": 229,
      "21": 230,
      "08": 231,
      "33": 232,
      "03": 233,
      "55": 234,
      "then": 235,
      "ab": 236,
      "44": 237,
      "25": 238,
      "ly": 239,
      "35": 240,
      "34": 241,
      "ce": 242,
      "ind": 243,
      "32": 244,
      "con": 245,
      "cl": 246,
      "will": 247,
      "ctu": 248,
      "45": 249,
      "di": 250,
      "41": 251,
      "51": 252,
      "Th": 253,
      "43": 254,
      "42": 255,
      "31": 256,
      "wor": 257,
      "just": 258,
      "52": 259,
      "53": 260,
      "right": 261,
      "int": 262,
      "hich": 263,
      "ea": 264,
      "ex": 265,
      "ul": 266,
      "equ": 267,
      "some": 268,
      "kind": 269,
      "which": 270,
      "par": 271,
      "res": 272,
      "not": 273,
      "ma": 274,
      "by": 275,
      "iz": 276,
      "mp": 277,
      "go": 278,
      "equal": 279,
      "here": 280,
      "ctually": 281,
      "rans": 282,
      "pl": 283,
      "ow": 284,
      "actually": 285,
      "ant": 286,
      "there": 287,
      "min": 288,
      "use": 289,
      "these": 290,
      "um": 291,
      "over": 292,
      "But": 293,
      "ld": 294,
      "ass": 295,
      "gra": 296,
      "pose": 297,
      "loo": 298,
      "thing": 299,
      "tim": 300,
      "ur": 301,
      "pe": 302,
      "ca": 303,
      "ink": 304,
      "ble": 305,
      "mo": 306,
      "about": 307,
      "work": 308,
      "ter": 309,
      "very": 310,
      "look": 311,
      "put": 312,
      "point": 313,
      "ive": 314,
      "id": 315,
      "per": 316,
      "un": 317,
      "mean": 318,
      "ti": 319,
      "ther": 320,
      "think": 321,
      "with": 322,
      "ould": 323,
      "let": 324,
      "ry": 325,
      "trans": 326,
      "est": 327,
      "class": 328,
      "dat": 329,
      "ber": 330,
      "get": 331,
      "ight": 332,
      "say": 333,
      "want": 334,
      "ction": 335,
      "You": 336,
      "see": 337,
      "form": 338,
      "part": 339,
      "ine": 340,
      "ect": 341,
      "any": 342,
      "sa": 343,
      "ir": 344,
      "lear": 345,
      "blem": 346,
      "problem": 347,
      "ite": 348,
      "dient": 349,
      "op": 350,
      "It": 351,
      "minus": 352,
      "ad": 353,
      "plus": 354,
      "We": 355,
      "iv": 356,
      "uster": 357,
      "gradient": 358,
      "ess": 359,
      "how": 360,
      "but": 361,
      "call": 362,
      "ate": 363,
      "data": 364,
      "was": 365,
      "ep": 366,
      "cluster": 367,
      "du": 368,
      "ically": 369,
      "eah": 370,
      "ag": 371,
      "they": 372,
      "comp": 373,
      "The": 374,
      "ctor": 375,
      "your": 376,
      "ens": 377,
      "Thi": 378,
      "ac": 379,
      "ig": 380,
      "od": 381,
      "ity": 382,
      "learn": 383,
      "other": 384,
      "450": 385,
      "ions": 386,
      "vector": 387,
      "This": 388,
      "net": 389,
      "am": 390,
      "mat": 391,
      "Wh": 392,
      "ard": 393,
      "ular": 394,
      "when": 395,
      "ore": 396,
      "680": 397,
      "260": 398,
      "760": 399,
      "ject": 400,
      "700": 401,
      "sup": 402,
      "110": 403,
      "140": 404,
      "340": 405,
      "exa": 406,
      "420": 407,
      "460": 408,
      "100": 409,
      "490": 410,
      "network": 411,
      "500": 412,
      "920": 413,
      "520": 414,
      "try": 415,
      "than": 416,
      "040": 417,
      "tal": 418,
      "points": 419,
      "fro": 420,
      "tra": 421,
      "300": 422,
      "600": 423,
      "960": 424,
      "line": 425,
      "ize": 426,
      "720": 427,
      "740": 428,
      "from": 429,
      "080": 430,
      "cause": 431,
      "220": 432,
      "660": 433,
      "930": 434,
      "190": 435,
      "pre": 436,
      "280": 437,
      "320": 438,
      "950": 439,
      "160": 440,
      "fun": 441,
      "rou": 442,
      "150": 443,
      "400": 444,
      "000": 445,
      "times": 446,
      "240": 447,
      "750": 448,
      "440": 449,
      "560": 450,
      "function": 451,
      "120": 452,
      "130": 453,
      "310": 454,
      "510": 455,
      "540": 456,
      "800": 457,
      "fer": 458,
      "each": 459,
      "330": 460,
      "360": 461,
      "870": 462,
      "quest": 463,
      "530": 464,
      "640": 465,
      "ence": 466,
      "980": 467,
      "also": 468,
      "means": 469,
      "380": 470,
      "910": 471,
      "990": 472,
      "ist": 473,
      "word": 474,
      "580": 475,
      "570": 476,
      "610": 477,
      "710": 478,
      "way": 479,
      "linear": 480,
      "070": 481,
      "ss": 482,
      "170": 483,
      "270": 484,
      "wr": 485,
      "480": 486,
      "550": 487,
      "val": 488,
      "230": 489,
      "290": 490,
      "learning": 491,
      "410": 492,
      "810": 493,
      "940": 494,
      "more": 495,
      "020": 496,
      "take": 497,
      "because": 498,
      "ations": 499,
      "620": 500,
      "670": 501,
      "860": 502,
      "880": 503,
      "pa": 504,
      "010": 505,
      "set": 506,
      "going": 507,
      "060": 508,
      "350": 509,
      "su": 510,
      "called": 511,
      "ment": 512,
      "850": 513,
      "et": 514,
      "our": 515,
      "star": 516,
      "210": 517,
      "770": 518,
      "470": 519,
      "780": 520,
      "matri": 521,
      "250": 522,
      "430": 523,
      "840": 524,
      "mem": 525,
      "390": 526,
      "la": 527,
      "090": 528,
      "ial": 529,
      "where": 530,
      "690": 531,
      "900": 532,
      "com": 533,
      "370": 534,
      "790": 535,
      "830": 536,
      "gre": 537,
      "ide": 538,
      "rough": 539,
      "pha": 540,
      "mple": 541,
      "630": 542,
      "through": 543,
      "050": 544,
      "pres": 545,
      "train": 546,
      "valu": 547,
      "200": 548,
      "650": 549,
      "820": 550,
      "input": 551,
      "180": 552,
      "730": 553,
      "der": 554,
      "squ": 555,
      "890": 556,
      "970": 557,
      "ort": 558,
      "const": 559,
      "member": 560,
      "030": 561,
      "590": 562,
      "sh": 563,
      "age": 564,
      "able": 565,
      "ack": 566,
      "pt": 567,
      "ot": 568,
      "sim": 569,
      "num": 570,
      "chi": 571,
      "dif": 572,
      "asically": 573,
      "cre": 574,
      "end": 575,
      "ition": 576,
      "mul": 577,
      "rank": 578,
      "ith": 579,
      "king": 580,
      "my": 581,
      "giv": 582,
      "ong": 583,
      "itrank": 584,
      "optim": 585,
      "matrix": 586,
      "number": 587,
      "fe": 588,
      "lay": 589,
      "example": 590,
      "present": 591,
      "One": 592,
      "Trans": 593,
      "des": 594,
      "irst": 595,
      "differ": 596,
      "multi": 597,
      "day": 598,
      "icular": 599,
      "St": 600,
      "ap": 601,
      "basically": 602,
      "If": 603,
      "ari": 604,
      "particular": 605,
      "ms": 606,
      "port": 607,
      "time": 608,
      "ty": 609,
      "into": 610,
      "output": 611,
      "Transpose": 612,
      "first": 613,
      "layer": 614,
      "itt": 615,
      "has": 616,
      "67": 617,
      "ill": 618,
      "square": 619,
      "Al": 620,
      "ple": 621,
      "ural": 622,
      "comput": 623,
      "gor": 624,
      "del": 625,
      "something": 626,
      "classif": 627,
      "cent": 628,
      "imens": 629,
      "machi": 630,
      "transform": 631,
      "transpose": 632,
      "would": 633,
      "ization": 634,
      "Yeah": 635,
      "back": 636,
      "dimens": 637,
      "gorith": 638,
      "ob": 639,
      "vi": 640,
      "vari": 641,
      "68": 642,
      "69": 643,
      "yeah": 644,
      "doing": 645,
      "same": 646,
      "training": 647,
      "sum": 648,
      "remember": 649,
      "What": 650,
      "different": 651,
      "pli": 652,
      "ure": 653,
      "ext": 654,
      "write": 655,
      "sol": 656,
      "model": 657,
      "ater": 658,
      "step": 659,
      "bel": 660,
      "does": 661,
      "constra": 662,
      "ding": 663,
      "algorith": 664,
      "why": 665,
      "okay": 666,
      "start": 667,
      "dual": 668,
      "gu": 669,
      "Is": 670,
      "ol": 671,
      "them": 672,
      "questions": 673,
      "mu": 674,
      "using": 675,
      "cor": 676,
      "ward": 677,
      "Right": 678,
      "ain": 679,
      "bit": 680,
      "don": 681,
      "pr": 682,
      "come": 683,
      "constraint": 684,
      "vis": 685,
      "only": 686,
      "bet": 687,
      "cture": 688,
      "need": 689,
      "could": 690,
      "ially": 691,
      "ional": 692,
      "neural": 693,
      "loss": 694,
      "well": 695,
      "project": 696,
      "minim": 697,
      "cond": 698,
      "That": 699,
      "equals": 700,
      "Well": 701,
      "Alpha": 702,
      "el": 703,
      "hy": 704,
      "plan": 705,
      "orm": 706,
      "every": 707,
      "ho": 708,
      "thod": 709,
      "things": 710,
      "much": 711,
      "ame": 712,
      "many": 713,
      "ph": 714,
      "method": 715,
      "given": 716,
      "Let": 717,
      "xt": 718,
      "Then": 719,
      "make": 720,
      "tent": 721,
      "orry": 722,
      "sequ": 723,
      "value": 724,
      "algorithm": 725,
      "Ch": 726,
      "Now": 727,
      "lar": 728,
      "def": 729,
      "lot": 730,
      "ittle": 731,
      "little": 732,
      "ous": 733,
      "ked": 734,
      "hyper": 735,
      "ces": 736,
      "separ": 737,
      "chan": 738,
      "ople": 739,
      "transformer": 740,
      "norm": 741,
      "ated": 742,
      "next": 743,
      "sta": 744,
      "were": 745,
      "people": 746,
      "66": 747,
      "ating": 748,
      "ance": 749,
      "arch": 750,
      "ilar": 751,
      "reg": 752,
      "did": 753,
      "cept": 754,
      "said": 755,
      "should": 756,
      "Star": 757,
      "object": 758,
      "cal": 759,
      "ided": 760,
      "clusters": 761,
      "may": 762,
      "talk": 763,
      "he": 764,
      "weight": 765,
      "ourse": 766,
      "summ": 767,
      "course": 768,
      "might": 769,
      "text": 770,
      "ctly": 771,
      "produ": 772,
      "ven": 773,
      "init": 774,
      "dimensional": 775,
      "Chitrank": 776,
      "ener": 777,
      "greater": 778,
      "Oh": 779,
      "cur": 780,
      "gener": 781,
      "graph": 782,
      "looking": 783,
      "tention": 784,
      "hyperplan": 785,
      "ase": 786,
      "give": 787,
      "pp": 788,
      "sion": 789,
      "div": 790,
      "trying": 791,
      "done": 792,
      "ual": 793,
      "attention": 794,
      "really": 795,
      "used": 796,
      "predi": 797,
      "machine": 798,
      "au": 799,
      "size": 800,
      "ative": 801,
      "fore": 802,
      "again": 803,
      "classific": 804,
      "objective": 805,
      "less": 806,
      "case": 807,
      "most": 808,
      "summation": 809,
      "hyperplane": 810,
      "before": 811,
      "nel": 812,
      "question": 813,
      "les": 814,
      "ign": 815,
      "vectors": 816,
      "suppose": 817,
      "ameter": 818,
      "da": 819,
      "fa": 820,
      "ru": 821,
      "sent": 822,
      "tri": 823,
      "parameter": 824,
      "terms": 825,
      "sub": 826,
      "initial": 827,
      "classification": 828,
      "dist": 829,
      "ose": 830,
      "ound": 831,
      "ween": 832,
      "ution": 833,
      "happ": 834,
      "deep": 835,
      "There": 836,
      "ead": 837,
      "similar": 838,
      "between": 839,
      "Not": 840,
      "ator": 841,
      "Tim": 842,
      "big": 843,
      "iter": 844,
      "support": 845,
      "large": 846,
      "Times": 847,
      "te": 848,
      "had": 849,
      "sequence": 850,
      "dis": 851,
      "em": 852,
      "last": 853,
      "cut": 854,
      "sm": 855,
      "spe": 856,
      "another": 857,
      "too": 858,
      "imal": 859,
      "add": 860,
      "networks": 861,
      "divided": 862,
      "af": 863,
      "mis": 864,
      "today": 865,
      "represent": 866,
      "ck": 867,
      "second": 868,
      "read": 869,
      "entially": 870,
      "super": 871,
      "label": 872,
      "typ": 873,
      "small": 874,
      "ef": 875,
      "ice": 876,
      "Re": 877,
      "pon": 878,
      "ins": 879,
      "taking": 880,
      "chitrank": 881,
      "max": 882,
      "good": 883,
      "equality": 884,
      "amb": 885,
      "comes": 886,
      "plic": 887,
      "den": 888,
      "ker": 889,
      "conne": 890,
      "term": 891,
      "vious": 892,
      "ambda": 893,
      "99": 894,
      "Sv": 895,
      "nes": 896,
      "om": 897,
      "ting": 898,
      "Why": 899,
      "sli": 900,
      "mework": 901,
      "essentially": 902,
      "descent": 903,
      "kernel": 904,
      "vol": 905,
      "image": 906,
      "compute": 907,
      "stand": 908,
      "supervis": 909,
      "ast": 910,
      "ving": 911,
      "tail": 912,
      "context": 913,
      "respon": 914,
      "agran": 915,
      "words": 916,
      "general": 917,
      "Min": 918,
      "cus": 919,
      "even": 920,
      "wer": 921,
      "ary": 922,
      "sel": 923,
      "alpha": 924,
      "state": 925,
      "bed": 926,
      "correspon": 927,
      "maybe": 928,
      "pri": 929,
      "spa": 930,
      "ult": 931,
      "archite": 932,
      "sentence": 933,
      "Of": 934,
      "bo": 935,
      "ense": 936,
      "solve": 937,
      "self": 938,
      "cess": 939,
      "find": 940,
      "ger": 941,
      "mer": 942,
      "must": 943,
      "oun": 944,
      "lecture": 945,
      "beta": 946,
      "import": 947,
      "new": 948,
      "ick": 949,
      "They": 950,
      "talked": 951,
      "optimization": 952,
      "parameters": 953,
      "typically": 954,
      "Svm": 955,
      "space": 956,
      "lan": 957,
      "show": 958,
      "wn": 959,
      "top": 960,
      "feat": 961,
      "belong": 962,
      "guage": 963,
      "language": 964,
      "far": 965,
      "ied": 966,
      "sk": 967,
      "pret": 968,
      "values": 969,
      "methods": 970,
      "normal": 971,
      "predict": 972,
      "after": 973,
      "clo": 974,
      "ew": 975,
      "ner": 976,
      "ull": 977,
      "ince": 978,
      "still": 979,
      "quant": 980,
      "ables": 981,
      "simple": 982,
      "primal": 983,
      "Minus": 984,
      "79": 985,
      "Lambda": 986,
      "fo": 987,
      "ply": 988,
      "sorry": 989,
      "tens": 990,
      "ise": 991,
      "order": 992,
      "quite": 993,
      "forward": 994,
      "log": 995,
      "pend": 996,
      "classes": 997,
      "clustering": 998,
      "variables": 999,
      "embed": 1000,
      "89": 1001,
      "Be": 1002,
      "ible": 1003,
      "sing": 1004,
      "sense": 1005,
      "since": 1006,
      "those": 1007,
      "task": 1008,
      "been": 1009,
      "discus": 1010,
      "maxim": 1011,
      "istic": 1012,
      "change": 1013,
      "product": 1014,
      "supervised": 1015,
      "pretty": 1016,
      "Sorry": 1017,
      "rent": 1018,
      "eng": 1019,
      "degre": 1020,
      "appro": 1021,
      "homework": 1022,
      "happen": 1023,
      "ready": 1024,
      "embedding": 1025,
      "Xi": 1026,
      "ese": 1027,
      "being": 1028,
      "ross": 1029,
      "dot": 1030,
      "convol": 1031,
      "inter": 1032,
      "ression": 1033,
      "saying": 1034,
      "gradients": 1035,
      "exactly": 1036,
      "linearly": 1037,
      "define": 1038,
      "In": 1039,
      "ear": 1040,
      "fin": 1041,
      "full": 1042,
      "oper": 1043,
      "inequality": 1044,
      "off": 1045,
      "ases": 1046,
      "conver": 1047,
      "These": 1048,
      "defin": 1049,
      "regression": 1050,
      "aught": 1051,
      "tensor": 1052,
      "degree": 1053,
      "long": 1054,
      "non": 1055,
      "already": 1056,
      "cted": 1057,
      "down": 1058,
      "percept": 1059,
      "quantity": 1060,
      "For": 1061,
      "Ga": 1062,
      "pos": 1063,
      "coder": 1064,
      "result": 1065,
      "wanted": 1066,
      "current": 1067,
      "important": 1068,
      "bal": 1069,
      "bod": 1070,
      "updat": 1071,
      "cho": 1072,
      "ical": 1073,
      "transl": 1074,
      "problems": 1075,
      "talking": 1076,
      "classified": 1077,
      "constraints": 1078,
      "minimiz": 1079,
      "weights": 1080,
      "close": 1081,
      "body": 1082,
      "ful": 1083,
      "ove": 1084,
      "under": 1085,
      "inst": 1086,
      "lement": 1087,
      "machines": 1088,
      "eff": 1089,
      "ount": 1090,
      "Li": 1091,
      "act": 1092,
      "ies": 1093,
      "ron": 1094,
      "detail": 1095,
      "depend": 1096,
      "dire": 1097,
      "pect": 1098,
      "partition": 1099,
      "paper": 1100,
      "such": 1101,
      "multiple": 1102,
      "cy": 1103,
      "ei": 1104,
      "ian": 1105,
      "ns": 1106,
      "pag": 1107,
      "ility": 1108,
      "ason": 1109,
      "above": 1110,
      "ument": 1111,
      "idea": 1112,
      "deriv": 1113,
      "ends": 1114,
      "multipli": 1115,
      "layers": 1116,
      "minimize": 1117,
      "distance": 1118,
      "architecture": 1119,
      "fully": 1120,
      "Ma": 1121,
      "clear": 1122,
      "hal": 1123,
      "ken": 1124,
      "sign": 1125,
      "uh": 1126,
      "itions": 1127,
      "ank": 1128,
      "oft": 1129,
      "reason": 1130,
      "keep": 1131,
      "who": 1132,
      "quick": 1133,
      "optimal": 1134,
      "solution": 1135,
      "transformers": 1136,
      "slight": 1137,
      "An": 1138,
      "Yuh": 1139,
      "cul": 1140,
      "gin": 1141,
      "mm": 1142,
      "sto": 1143,
      "ask": 1144,
      "move": 1145,
      "says": 1146,
      "Remember": 1147,
      "Gao": 1148,
      "half": 1149,
      "Yuhan": 1150,
      "eas": 1151,
      "rand": 1152,
      "sy": 1153,
      "ures": 1154,
      "becomes": 1155,
      "decre": 1156,
      "propag": 1157,
      "getting": 1158,
      "optimiz": 1159,
      "better": 1160,
      "calcul": 1161,
      "agrange": 1162,
      "77": 1163,
      "Vect": 1164,
      "bin": 1165,
      "glo": 1166,
      "kes": 1167,
      "nice": 1168,
      "won": 1169,
      "inner": 1170,
      "their": 1171,
      "ways": 1172,
      "sets": 1173,
      "applic": 1174,
      "ased": 1175,
      "foll": 1176,
      "perceptron": 1177,
      "instead": 1178,
      "Vector": 1179,
      "Sup": 1180,
      "Vc": 1181,
      "ges": 1182,
      "link": 1183,
      "later": 1184,
      "sur": 1185,
      "ys": 1186,
      "ers": 1187,
      "iting": 1188,
      "atch": 1189,
      "meas": 1190,
      "qual": 1191,
      "root": 1192,
      "main": 1193,
      "moment": 1194,
      "separable": 1195,
      "inside": 1196,
      "connected": 1197,
      "standard": 1198,
      "Max": 1199,
      "78": 1200,
      "ach": 1201,
      "ci": 1202,
      "cri": 1203,
      "mon": 1204,
      "sd": 1205,
      "vide": 1206,
      "its": 1207,
      "ates": 1208,
      "seen": 1209,
      "ily": 1210,
      "real": 1211,
      "roid": 1212,
      "col": 1213,
      "Thank": 1214,
      "got": 1215,
      "pair": 1216,
      "sure": 1217,
      "bigger": 1218,
      "translation": 1219,
      "Hmm": 1220,
      "head": 1221,
      "tru": 1222,
      "power": 1223,
      "ctures": 1224,
      "previous": 1225,
      "create": 1226,
      "feas": 1227,
      "backward": 1228,
      "view": 1229,
      "spec": 1230,
      "either": 1231,
      "Gp": 1232,
      "cr": 1233,
      "cir": 1234,
      "ey": 1235,
      "iqu": 1236,
      "oh": 1237,
      "os": 1238,
      "pi": 1239,
      "rate": 1240,
      "soft": 1241,
      "tur": 1242,
      "high": 1243,
      "incre": 1244,
      "capt": 1245,
      "variable": 1246,
      "models": 1247,
      "visual": 1248,
      "tech": 1249,
      "belongs": 1250,
      "derivative": 1251,
      "random": 1252,
      "propagation": 1253,
      "Suppose": 1254,
      "Lsd": 1255,
      "aver": 1256,
      "cument": 1257,
      "dra": 1258,
      "mar": 1259,
      "ning": 1260,
      "pass": 1261,
      "tor": 1262,
      "least": 1263,
      "document": 1264,
      "cost": 1265,
      "clu": 1266,
      "exp": 1267,
      "expl": 1268,
      "perform": 1269,
      "formation": 1270,
      "When": 1271,
      "writt": 1272,
      "corre": 1273,
      "initializ": 1274,
      "correspond": 1275,
      "Any": 1276,
      "measure": 1277,
      "techn": 1278,
      "written": 1279,
      "64": 1280,
      "Go": 1281,
      "Wt": 1282,
      "Which": 1283,
      "bra": 1284,
      "dden": 1285,
      "ether": 1286,
      "ient": 1287,
      "tic": 1288,
      "wise": 1289,
      "once": 1290,
      "around": 1291,
      "ute": 1292,
      "whether": 1293,
      "neg": 1294,
      "sometimes": 1295,
      "grad": 1296,
      "looks": 1297,
      "idual": 1298,
      "compet": 1299,
      "matrices": 1300,
      "squar": 1301,
      "multiply": 1302,
      "centroid": 1303,
      "initialization": 1304,
      "labels": 1305,
      "corresponding": 1306,
      "prime": 1307,
      "feature": 1308,
      "follow": 1309,
      "links": 1310,
      "true": 1311,
      "As": 1312,
      "Lagrange": 1313,
      "bi": 1314,
      "cross": 1315,
      "oc": 1316,
      "stu": 1317,
      "metri": 1318,
      "vel": 1319,
      "edge": 1320,
      "near": 1321,
      "pop": 1322,
      "process": 1323,
      "equations": 1324,
      "respect": 1325,
      "came": 1326,
      "esting": 1327,
      "few": 1328,
      "presentations": 1329,
      "descri": 1330,
      "doesn": 1331,
      "hope": 1332,
      "similarly": 1333,
      "viously": 1334,
      "happening": 1335,
      "average": 1336,
      "techniqu": 1337,
      "negative": 1338,
      "metric": 1339,
      "439": 1340,
      "Cl": 1341,
      "How": 1342,
      "Yc": 1343,
      "Yes": 1344,
      "cu": 1345,
      "ging": 1346,
      "nat": 1347,
      "ness": 1348,
      "naught": 1349,
      "ser": 1350,
      "side": 1351,
      "ually": 1352,
      "hidden": 1353,
      "encoder": 1354,
      "upon": 1355,
      "lier": 1356,
      "become": 1357,
      "chast": 1358,
      "exist": 1359,
      "igen": 1360,
      "illion": 1361,
      "prediction": 1362,
      "discuss": 1363,
      "convolution": 1364,
      "stochast": 1365,
      "applications": 1366,
      "momentum": 1367,
      "competition": 1368,
      "stochastic": 1369,
      "101": 1370,
      "76": 1371,
      "No": 1372,
      "Zeng": 1373,
      "bu": 1374,
      "bab": 1375,
      "element": 1376,
      "eigen": 1377,
      "ng": 1378,
      "qi": 1379,
      "itive": 1380,
      "information": 1381,
      "ough": 1382,
      "ory": 1383,
      "109": 1384,
      "sed": 1385,
      "alge": 1386,
      "poss": 1387,
      "code": 1388,
      "cons": 1389,
      "pear": 1390,
      "mention": 1391,
      "combin": 1392,
      "appear": 1393,
      "started": 1394,
      "projects": 1395,
      "else": 1396,
      "separating": 1397,
      "face": 1398,
      "addition": 1399,
      "misclassified": 1400,
      "representation": 1401,
      "features": 1402,
      "Liu": 1403,
      "feasible": 1404,
      "criter": 1405,
      "draw": 1406,
      "Zengqi": 1407,
      "algebra": 1408,
      "88": 1409,
      "batch": 1410,
      "cing": 1411,
      "cases": 1412,
      "fi": 1413,
      "ire": 1414,
      "man": 1415,
      "nn": 1416,
      "pus": 1417,
      "onal": 1418,
      "ities": 1419,
      "lead": 1420,
      "level": 1421,
      "ree": 1422,
      "reme": 1423,
      "requ": 1424,
      "imag": 1425,
      "159": 1426,
      "149": 1427,
      "ify": 1428,
      "dec": 1429,
      "479": 1430,
      "ized": 1431,
      "thinking": 1432,
      "coming": 1433,
      "gives": 1434,
      "giving": 1435,
      "Std": 1436,
      "steps": 1437,
      "regular": 1438,
      "produce": 1439,
      "happens": 1440,
      "both": 1441,
      "merge": 1442,
      "update": 1443,
      "effic": 1444,
      "419": 1445,
      "529": 1446,
      "gian": 1447,
      "list": 1448,
      "run": 1449,
      "ences": 1450,
      "token": 1451,
      "led": 1452,
      "world": 1453,
      "looked": 1454,
      "anything": 1455,
      "amma": 1456,
      "constant": 1457,
      "dimensions": 1458,
      "variance": 1459,
      "auto": 1460,
      "agrangian": 1461,
      "slightly": 1462,
      "torch": 1463,
      "popular": 1464,
      "combination": 1465,
      "319": 1466,
      "339": 1467,
      "449": 1468,
      "559": 1469,
      "649": 1470,
      "Can": 1471,
      "Squ": 1472,
      "Where": 1473,
      "based": 1474,
      "cat": 1475,
      "ced": 1476,
      "emp": 1477,
      "ft": 1478,
      "scre": 1479,
      "art": 1480,
      "refer": 1481,
      "ific": 1482,
      "175": 1483,
      "189": 1484,
      "399": 1485,
      "low": 1486,
      "469": 1487,
      "probab": 1488,
      "made": 1489,
      "works": 1490,
      "sample": 1491,
      "ird": 1492,
      "amount": 1493,
      "writing": 1494,
      "extreme": 1495,
      "conditions": 1496,
      "larger": 1497,
      "earlier": 1498,
      "final": 1499,
      "definite": 1500,
      "images": 1501,
      "efficient": 1502,
      "229": 1503,
      "539": 1504,
      "All": 1505,
      "By": 1506,
      "Just": 1507,
      "Ml": 1508,
      "ave": 1509,
      "bad": 1510,
      "bound": 1511,
      "cer": 1512,
      "grou": 1513,
      "hand": 1514,
      "hard": 1515,
      "rat": 1516,
      "ten": 1517,
      "ue": 1518,
      "ones": 1519,
      "ish": 1520,
      "toward": 1521,
      "tain": 1522,
      "str": 1523,
      "Some": 1524,
      "rel": 1525,
      "neur": 1526,
      "129": 1527,
      "569": 1528,
      "concept": 1529,
      "diag": 1530,
      "assign": 1531,
      "uristic": 1532,
      "saw": 1533,
      "great": 1534,
      "numbers": 1535,
      "algorithms": 1536,
      "guys": 1537,
      "everything": 1538,
      "hey": 1539,
      "heuristic": 1540,
      "spect": 1541,
      "connection": 1542,
      "Beta": 1543,
      "Because": 1544,
      "understand": 1545,
      "activ": 1546,
      "direction": 1547,
      "surface": 1548,
      "techniques": 1549,
      "Square": 1550,
      "neuron": 1551,
      "349": 1552,
      "459": 1553,
      "729": 1554,
      "87": 1555,
      "96": 1556,
      "Mu": 1557,
      "May": 1558,
      "Wed": 1559,
      "bility": 1560,
      "cou": 1561,
      "lack": 1562,
      "lagrangian": 1563,
      "ok": 1564,
      "ps": 1565,
      "609": 1566,
      "red": 1567,
      "lic": 1568,
      "begin": 1569,
      "ential": 1570,
      "having": 1571,
      "edges": 1572,
      "rief": 1573,
      "299": 1574,
      "489": 1575,
      "equation": 1576,
      "moving": 1577,
      "unsupervised": 1578,
      "within": 1579,
      "679": 1580,
      "guess": 1581,
      "hold": 1582,
      "subst": 1583,
      "nesday": 1584,
      "logistic": 1585,
      "approach": 1586,
      "operation": 1587,
      "details": 1588,
      "turns": 1589,
      "capture": 1590,
      "following": 1591,
      "natural": 1592,
      "mentioned": 1593,
      "criterion": 1594,
      "screen": 1595,
      "Maybe": 1596,
      "Wednesday": 1597,
      "112": 1598,
      "259": 1599,
      "429": 1600,
      "519": 1601,
      "86": 1602,
      "Apr": 1603,
      "New": 1604,
      "Naught": 1605,
      "Se": 1606,
      "Will": 1607,
      "ak": 1608,
      "bre": 1609,
      "count": 1610,
      "ier": 1611,
      "ror": 1612,
      "ral": 1613,
      "slack": 1614,
      "went": 1615,
      "error": 1616,
      "hier": 1617,
      "inclu": 1618,
      "estim": 1619,
      "ans": 1620,
      "209": 1621,
      "repe": 1622,
      "key": 1623,
      "ents": 1624,
      "row": 1625,
      "119": 1626,
      "usually": 1627,
      "139": 1628,
      "379": 1629,
      "residual": 1630,
      "makes": 1631,
      "goes": 1632,
      "cap": 1633,
      "gets": 1634,
      "learned": 1635,
      "apply": 1636,
      "dimension": 1637,
      "board": 1638,
      "shown": 1639,
      "convolut": 1640,
      "position": 1641,
      "partitioning": 1642,
      "multiplier": 1643,
      "quality": 1644,
      "video": 1645,
      "occur": 1646,
      "regularization": 1647,
      "diagonal": 1648,
      "April": 1649,
      "249": 1650,
      "359": 1651,
      "669": 1652,
      "97": 1653,
      "98": 1654,
      "Here": 1655,
      "My": 1656,
      "Or": 1657,
      "Sim": 1658,
      "With": 1659,
      "brief": 1660,
      "ever": 1661,
      "ff": 1662,
      "fy": 1663,
      "fine": 1664,
      "fig": 1665,
      "name": 1666,
      "spar": 1667,
      "scal": 1668,
      "toge": 1669,
      "107": 1670,
      "108": 1671,
      "409": 1672,
      "always": 1673,
      "ered": 1674,
      "impro": 1675,
      "vertic": 1676,
      "169": 1677,
      "289": 1678,
      "279": 1679,
      "range": 1680,
      "uring": 1681,
      "formul": 1682,
      "igma": 1683,
      "constru": 1684,
      "computer": 1685,
      "computing": 1686,
      "obviously": 1687,
      "minimum": 1688,
      "ilarly": 1689,
      "fact": 1690,
      "priate": 1691,
      "topic": 1692,
      "tasks": 1693,
      "maximum": 1694,
      "maximize": 1695,
      "appropriate": 1696,
      "interesting": 1697,
      "results": 1698,
      "quickly": 1699,
      "syst": 1700,
      "decrease": 1701,
      "optimizer": 1702,
      "global": 1703,
      "Lsdms": 1704,
      "initializations": 1705,
      "towards": 1706,
      "substit": 1707,
      "Similarly": 1708,
      "together": 1709,
      "vertices": 1710,
      "329": 1711,
      "639": 1712,
      "Actually": 1713,
      "Cnn": 1714,
      "Del": 1715,
      "Lo": 1716,
      "Po": 1717,
      "To": 1718,
      "ago": 1719,
      "bar": 1720,
      "eve": 1721,
      "fam": 1722,
      "hel": 1723,
      "lat": 1724,
      "million": 1725,
      "sat": 1726,
      "van": 1727,
      "year": 1728,
      "erial": 1729,
      "ances": 1730,
      "106": 1731,
      "309": 1732,
      "lex": 1733,
      "wed": 1734,
      "wee": 1735,
      "179": 1736,
      "load": 1737,
      "599": 1738,
      "389": 1739,
      "coll": 1740,
      "indic": 1741,
      "mail": 1742,
      "mples": 1743,
      "pla": 1744,
      "bution": 1745,
      "material": 1746,
      "setting": 1747,
      "ments": 1748,
      "shar": 1749,
      "creating": 1750,
      "optimize": 1751,
      "feed": 1752,
      "difference": 1753,
      "computation": 1754,
      "689": 1755,
      "smaller": 1756,
      "insight": 1757,
      "architectures": 1758,
      "products": 1759,
      "balan": 1760,
      "choose": 1761,
      "minimizing": 1762,
      "effect": 1763,
      "colum": 1764,
      "margin": 1765,
      "corresponds": 1766,
      "eigenvectors": 1767,
      "possible": 1768,
      "drawback": 1769,
      "boundary": 1770,
      "beginning": 1771,
      "break": 1772,
      "estimator": 1773,
      "years": 1774,
      "219": 1775,
      "549": 1776,
      "619": 1777,
      "719": 1778,
      "Do": 1779,
      "Ex": 1780,
      "Sigma": 1781,
      "cle": 1782,
      "cise": 1783,
      "email": 1784,
      "fra": 1785,
      "found": 1786,
      "ged": 1787,
      "gence": 1788,
      "gamma": 1789,
      "hat": 1790,
      "arily": 1791,
      "takes": 1792,
      "509": 1793,
      "almost": 1794,
      "allow": 1795,
      "ric": 1796,
      "rid": 1797,
      "version": 1798,
      "ract": 1799,
      "589": 1800,
      "369": 1801,
      "cles": 1802,
      "expres": 1803,
      "except": 1804,
      "making": 1805,
      "compon": 1806,
      "complement": 1807,
      "across": 1808,
      "thank": 1809,
      "presentation": 1810,
      "everybody": 1811,
      "didn": 1812,
      "dimensionality": 1813,
      "iteration": 1814,
      "singular": 1815,
      "operations": 1816,
      "convergence": 1817,
      "positive": 1818,
      "easier": 1819,
      "squares": 1820,
      "stud": 1821,
      "nearest": 1822,
      "hopefully": 1823,
      "buil": 1824,
      "additional": 1825,
      "definitely": 1826,
      "figure": 1827,
      "construct": 1828,
      "week": 1829,
      "629": 1830,
      "779": 1831,
      "Bel": 1832,
      "car": 1833,
      "dou": 1834,
      "earch": 1835,
      "py": 1836,
      "sp": 1837,
      "wal": 1838,
      "ware": 1839,
      "though": 1840,
      "ery": 1841,
      "itself": 1842,
      "hin": 1843,
      "hile": 1844,
      "ouch": 1845,
      "archi": 1846,
      "total": 1847,
      "velo": 1848,
      "asing": 1849,
      "haven": 1850,
      "imple": 1851,
      "rodu": 1852,
      "potent": 1853,
      "decoder": 1854,
      "develo": 1855,
      "499": 1856,
      "069": 1857,
      "269": 1858,
      "579": 1859,
      "conf": 1860,
      "cont": 1861,
      "conve": 1862,
      "intu": 1863,
      "rest": 1864,
      "research": 1865,
      "izing": 1866,
      "play": 1867,
      "ider": 1868,
      "ung": 1869,
      "without": 1870,
      "pluses": 1871,
      "calling": 1872,
      "ensive": 1873,
      "whereas": 1874,
      "ongs": 1875,
      "days": 1876,
      "outputs": 1877,
      "699": 1878,
      "oling": 1879,
      "pring": 1880,
      "sequential": 1881,
      "distances": 1882,
      "slides": 1883,
      "finally": 1884,
      "updates": 1885,
      "Like": 1886,
      "depends": 1887,
      "directly": 1888,
      "whole": 1889,
      "processing": 1890,
      "consider": 1891,
      "connections": 1892,
      "convolutional": 1893,
      "improve": 1894,
      "system": 1895,
      "help": 1896,
      "indicator": 1897,
      "place": 1898,
      "Belongs": 1899,
      "implement": 1900,
      "029": 1901,
      "239": 1902,
      "512": 1903,
      "62": 1904,
      "659": 1905,
      "82": 1906,
      "Basically": 1907,
      "Div": 1908,
      "He": 1909,
      "Vt": 1910,
      "away": 1911,
      "bird": 1912,
      "cially": 1913,
      "ometric": 1914,
      "pract": 1915,
      "resh": 1916,
      "sha": 1917,
      "tea": 1918,
      "xi": 1919,
      "hist": 1920,
      "ature": 1921,
      "espe": 1922,
      "ors": 1923,
      "taken": 1924,
      "204": 1925,
      "along": 1926,
      "lectures": 1927,
      "asso": 1928,
      "nothing": 1929,
      "che": 1930,
      "ently": 1931,
      "necess": 1932,
      "199": 1933,
      "131": 1934,
      "racy": 1935,
      "loc": 1936,
      "local": 1937,
      "coding": 1938,
      "cool": 1939,
      "224": 1940,
      "proper": 1941,
      "introdu": 1942,
      "note": 1943,
      "bye": 1944,
      "goal": 1945,
      "own": 1946,
      "overall": 1947,
      "working": 1948,
      "ident": 1949,
      "till": 1950,
      "due": 1951,
      "accu": 1952,
      "past": 1953,
      "inputs": 1954,
      "multiplic": 1955,
      "various": 1956,
      "needs": 1957,
      "separate": 1958,
      "distri": 1959,
      "denot": 1960,
      "glomer": 1961,
      "eyes": 1962,
      "higher": 1963,
      "correct": 1964,
      "Good": 1965,
      "bias": 1966,
      "activation": 1967,
      "hierarchi": 1968,
      "complementary": 1969,
      "double": 1970,
      "develop": 1971,
      "Divided": 1972,
      "especially": 1973,
      "accuracy": 1974,
      "115": 1975,
      "114": 1976,
      "201": 1977,
      "212": 1978,
      "215": 1979,
      "214": 1980,
      "211": 1981,
      "217": 1982,
      "213": 1983,
      "218": 1984,
      "216": 1985,
      "246": 1986,
      "237": 1987,
      "238": 1988,
      "228": 1989,
      "248": 1990,
      "226": 1991,
      "227": 1992,
      "258": 1993,
      "247": 1994,
      "223": 1995,
      "256": 1996,
      "254": 1997,
      "257": 1998,
      "255": 1999
    },
    "merges": [
      "0 0",
      "t h",
      "e r",
      "o n",
      "n d",
      "l l",
      "i t",
      "- -",
      "-- >",
      "h i",
      "nd er",
      "D hi",
      "I nder",
      "j it",
      "ll on",
      "Dhi llon",
      "Inder jit",
      "i n",
      "th e",
      "a t",
      "i s",
      "0 1",
      "o u",
      "e s",
      "a n",
      "a r",
      "o r",
      "e n",
      "t o",
      "y ou",
      "in g",
      "1 0",
      "t a",
      "2 0",
      "o f",
      "s e",
      "4 0",
      "5 0",
      "a l",
      "3 0",
      "a nd",
      "u p",
      "th at",
      "i l",
      "s t",
      "i on",
      "th is",
      "m e",
      "6 0",
      "a y",
      "S o",
      "l e",
      "G up",
      "Gup ta",
      "r e",
      "c t",
      "8 0",
      "es h",
      "N il",
      "Nil esh",
      "v e",
      "7 0",
      "k e",
      "9 0",
      "a s",
      "s o",
      "a ll",
      "l i",
      "b e",
      "n o",
      "c h",
      "w e",
      "li ke",
      "u t",
      "en t",
      "w h",
      "er e",
      "q u",
      "h a",
      "e d",
      "g h",
      "i m",
      "r o",
      "ar e",
      "k ay",
      "on e",
      "n e",
      "f or",
      "r i",
      "c an",
      "1 2",
      "1 5",
      "no w",
      "all y",
      "O kay",
      "w i",
      "1 4",
      "gh t",
      "v er",
      "1 1",
      "u st",
      "p o",
      "1 9",
      "i f",
      "1 7",
      "u s",
      "1 3",
      "1 8",
      "i c",
      "ha ve",
      "d e",
      "1 6",
      "3 9",
      "r a",
      "l o",
      "2 9",
      "at ion",
      "A nd",
      "d o",
      "g e",
      "4 9",
      "4 6",
      "5 9",
      "3 7",
      "3 8",
      "2 8",
      "0 6",
      "4 8",
      "2 6",
      "2 7",
      "5 8",
      "4 7",
      "2 3",
      "c o",
      "5 6",
      "0 9",
      "0 5",
      "3 6",
      "2 2",
      "5 4",
      "wh at",
      "k now",
      "0 7",
      "p ro",
      "0 2",
      "2 4",
      "5 7",
      "r an",
      "ou t",
      "0 4",
      "2 1",
      "0 8",
      "3 3",
      "0 3",
      "5 5",
      "the n",
      "a b",
      "4 4",
      "2 5",
      "l y",
      "3 5",
      "3 4",
      "c e",
      "i nd",
      "3 2",
      "c on",
      "c l",
      "wi ll",
      "ct u",
      "4 5",
      "d i",
      "4 1",
      "5 1",
      "T h",
      "4 3",
      "4 2",
      "3 1",
      "w or",
      "j ust",
      "5 2",
      "5 3",
      "ri ght",
      "in t",
      "hi ch",
      "e a",
      "e x",
      "u l",
      "e qu",
      "so me",
      "k ind",
      "w hich",
      "p ar",
      "r es",
      "no t",
      "m a",
      "b y",
      "i z",
      "m p",
      "g o",
      "equ al",
      "h ere",
      "ctu ally",
      "ran s",
      "p l",
      "o w",
      "a ctually",
      "an t",
      "th ere",
      "m in",
      "u se",
      "the se",
      "u m",
      "o ver",
      "B ut",
      "l d",
      "as s",
      "g ra",
      "po se",
      "lo o",
      "th ing",
      "t im",
      "u r",
      "p e",
      "c a",
      "in k",
      "b le",
      "m o",
      "ab out",
      "wor k",
      "t er",
      "ver y",
      "loo k",
      "p ut",
      "po int",
      "i ve",
      "i d",
      "p er",
      "u n",
      "me an",
      "t i",
      "th er",
      "th ink",
      "wi th",
      "ou ld",
      "le t",
      "r y",
      "t rans",
      "es t",
      "cl ass",
      "d at",
      "b er",
      "ge t",
      "i ght",
      "s ay",
      "w ant",
      "ct ion",
      "Y ou",
      "se e",
      "for m",
      "par t",
      "in e",
      "e ct",
      "an y",
      "s a",
      "i r",
      "le ar",
      "ble m",
      "pro blem",
      "it e",
      "di ent",
      "o p",
      "I t",
      "min us",
      "a d",
      "pl us",
      "W e",
      "i v",
      "ust er",
      "gra dient",
      "es s",
      "h ow",
      "b ut",
      "c all",
      "at e",
      "dat a",
      "w as",
      "e p",
      "cl uster",
      "d u",
      "ic ally",
      "ea h",
      "a g",
      "the y",
      "co mp",
      "Th e",
      "ct or",
      "you r",
      "en s",
      "T hi",
      "a c",
      "i g",
      "o d",
      "it y",
      "lear n",
      "o ther",
      "4 50",
      "ion s",
      "ve ctor",
      "Thi s",
      "ne t",
      "a m",
      "m at",
      "W h",
      "ar d",
      "ul ar",
      "wh en",
      "or e",
      "6 80",
      "2 60",
      "7 60",
      "j ect",
      "7 00",
      "s up",
      "1 10",
      "1 40",
      "3 40",
      "ex a",
      "4 20",
      "4 60",
      "1 00",
      "4 90",
      "net work",
      "5 00",
      "9 20",
      "5 20",
      "t ry",
      "th an",
      "0 40",
      "ta l",
      "point s",
      "f ro",
      "t ra",
      "3 00",
      "6 00",
      "9 60",
      "l ine",
      "iz e",
      "7 20",
      "7 40",
      "fro m",
      "0 80",
      "ca use",
      "2 20",
      "6 60",
      "9 30",
      "1 90",
      "p re",
      "2 80",
      "3 20",
      "9 50",
      "1 60",
      "f un",
      "r ou",
      "1 50",
      "4 00",
      "00 0",
      "tim es",
      "2 40",
      "7 50",
      "4 40",
      "5 60",
      "fun ction",
      "1 20",
      "1 30",
      "3 10",
      "5 10",
      "5 40",
      "8 00",
      "f er",
      "ea ch",
      "3 30",
      "3 60",
      "8 70",
      "qu est",
      "5 30",
      "6 40",
      "en ce",
      "9 80",
      "al so",
      "mean s",
      "3 80",
      "9 10",
      "9 90",
      "is t",
      "wor d",
      "5 80",
      "5 70",
      "6 10",
      "7 10",
      "w ay",
      "line ar",
      "0 70",
      "s s",
      "1 70",
      "2 70",
      "w r",
      "4 80",
      "5 50",
      "v al",
      "2 30",
      "2 90",
      "learn ing",
      "4 10",
      "8 10",
      "9 40",
      "m ore",
      "0 20",
      "ta ke",
      "be cause",
      "ation s",
      "6 20",
      "6 70",
      "8 60",
      "8 80",
      "p a",
      "01 0",
      "se t",
      "go ing",
      "0 60",
      "3 50",
      "s u",
      "call ed",
      "m ent",
      "8 50",
      "e t",
      "ou r",
      "st ar",
      "2 10",
      "7 70",
      "4 70",
      "7 80",
      "mat ri",
      "2 50",
      "4 30",
      "8 40",
      "me m",
      "3 90",
      "l a",
      "0 90",
      "i al",
      "wh ere",
      "6 90",
      "9 00",
      "co m",
      "3 70",
      "7 90",
      "8 30",
      "g re",
      "i de",
      "rou gh",
      "p ha",
      "mp le",
      "6 30",
      "th rough",
      "0 50",
      "p res",
      "tra in",
      "val u",
      "2 00",
      "6 50",
      "8 20",
      "in put",
      "1 80",
      "7 30",
      "d er",
      "s qu",
      "8 90",
      "9 70",
      "or t",
      "con st",
      "mem ber",
      "0 30",
      "5 90",
      "s h",
      "a ge",
      "ab le",
      "ac k",
      "p t",
      "o t",
      "s im",
      "n um",
      "c hi",
      "d if",
      "as ically",
      "c re",
      "e nd",
      "it ion",
      "m ul",
      "ran k",
      "i th",
      "k ing",
      "m y",
      "g iv",
      "on g",
      "it rank",
      "op tim",
      "matri x",
      "num ber",
      "f e",
      "l ay",
      "exa mple",
      "pres ent",
      "O ne",
      "T rans",
      "d es",
      "ir st",
      "dif fer",
      "mul ti",
      "d ay",
      "ic ular",
      "S t",
      "a p",
      "b asically",
      "I f",
      "ar i",
      "part icular",
      "m s",
      "p ort",
      "ti me",
      "t y",
      "in to",
      "out put",
      "Trans pose",
      "f irst",
      "lay er",
      "it t",
      "h as",
      "6 7",
      "i ll",
      "squ are",
      "A l",
      "p le",
      "ur al",
      "comp ut",
      "g or",
      "de l",
      "some thing",
      "class if",
      "c ent",
      "im ens",
      "ma chi",
      "trans form",
      "trans pose",
      "w ould",
      "iz ation",
      "Y eah",
      "b ack",
      "d imens",
      "gor ith",
      "o b",
      "v i",
      "v ari",
      "6 8",
      "6 9",
      "y eah",
      "do ing",
      "sa me",
      "train ing",
      "s um",
      "re member",
      "Wh at",
      "differ ent",
      "p li",
      "u re",
      "ex t",
      "wr ite",
      "so l",
      "mo del",
      "at er",
      "st ep",
      "be l",
      "do es",
      "const ra",
      "d ing",
      "al gorith",
      "wh y",
      "o kay",
      "star t",
      "du al",
      "g u",
      "I s",
      "o l",
      "the m",
      "quest ions",
      "m u",
      "us ing",
      "c or",
      "w ard",
      "R ight",
      "a in",
      "b it",
      "d on",
      "p r",
      "co me",
      "constra int",
      "v is",
      "on ly",
      "be t",
      "ctu re",
      "ne ed",
      "c ould",
      "i ally",
      "ion al",
